{
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
    "createdDateTime": "2025-09-10T18:12:45.8396141Z",
    "creationSource": null,
    "description": "",
    "lastModifiedDateTime": "2025-09-10T18:13:09.9981159Z",
    "name": "Restrictions",
    "platforms": "macOS",
    "priorityMetaData": null,
    "roleScopeTagIds": [
        "0"
    ],
    "settingCount": 1,
    "technologies": "mdm,appleRemoteManagement",
    "id": "6e9303ed-cba0-47ed-a194-5b4496f31426",
    "templateReference": {
        "templateId": "",
        "templateFamily": "none",
        "templateDisplayName": null,
        "templateDisplayVersion": null
    },
    "settings": [
        {
            "id": "0",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                "settingDefinitionId": "com.apple.mcx_com.apple.mcx-accounts",
                "settingInstanceTemplateReference": null,
                "groupSettingCollectionValue": [
                    {
                        "settingValueTemplateReference": null,
                        "children": [
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.mcx_disableguestaccount",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.mcx_disableguestaccount_true",
                                    "children": []
                                }
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "1",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                "settingDefinitionId": "com.apple.applicationaccess_com.apple.applicationaccess",
                "settingInstanceTemplateReference": null,
                "groupSettingCollectionValue": [
                    {
                        "settingValueTemplateReference": null,
                        "children": [
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowaccountmodification",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowaccountmodification_true",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowactivitycontinuation",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowactivitycontinuation_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowaddinggamecenterfriends",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowaddinggamecenterfriends_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowairplayincomingrequests",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowairplayincomingrequests_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowairdrop",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowairdrop_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowappleintelligencereport",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowappleintelligencereport_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowapplepersonalizedadvertising",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowapplepersonalizedadvertising_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowardremotemanagementmodification",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowardremotemanagementmodification_true",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowassistant",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowassistant_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowautounlock",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowautounlock_true",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowbluetoothmodification",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowbluetoothmodification_true",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowbluetoothsharingmodification",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowbluetoothsharingmodification_true",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowbookstore",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowbookstore_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowbookstoreerotica",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowbookstoreerotica_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowcamera",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowcamera_true",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowcloudaddressbook",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowcloudaddressbook_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowcloudbookmarks",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowcloudbookmarks_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowcloudcalendar",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowcloudcalendar_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowclouddesktopanddocuments",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowclouddesktopanddocuments_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowclouddocumentsync",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowclouddocumentsync_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowcloudfreeform",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowcloudfreeform_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowcloudkeychainsync",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowcloudkeychainsync_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowcloudmail",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowcloudmail_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowcloudnotes",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowcloudnotes_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowcloudphotolibrary",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowcloudphotolibrary_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowcloudprivaterelay",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowcloudprivaterelay_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowcloudreminders",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowcloudreminders_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowcontentcaching",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowcontentcaching_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowdefinitionlookup",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowdefinitionlookup_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowdevicenamemodification",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowdevicenamemodification_true",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowdiagnosticsubmission",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowdiagnosticsubmission_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowdictation",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowdictation_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowerasecontentandsettings",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowerasecontentandsettings_true",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowexplicitcontent",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowexplicitcontent_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowexternalintelligenceintegrations",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowexternalintelligenceintegrations_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowexternalintelligenceintegrationssignin",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowexternalintelligenceintegrationssignin_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowfilesharingmodification",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowfilesharingmodification_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowfindmydevice",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowfindmydevice_true",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowfindmyfriends",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowfindmyfriends_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowfingerprintforunlock",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowfingerprintforunlock_true",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowfingerprintmodification",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowfingerprintmodification_true",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowgamecenter",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowgamecenter_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowgenmoji",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowgenmoji_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowimageplayground",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowimageplayground_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowinternetsharingmodification",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowinternetsharingmodification_true",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowiphonemirroring",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowiphonemirroring_true",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowitunesfilesharing",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowitunesfilesharing_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowlocalusercreation",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowlocalusercreation_true",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowmailsmartreplies",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowmailsmartreplies_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowmailsummary",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowmailsummary_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowmediasharingmodification",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowmediasharingmodification_true",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowmultiplayergaming",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowmultiplayergaming_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowmusicservice",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowmusicservice_true",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allownotestranscription",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allownotestranscription_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allownotestranscriptionsummary",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allownotestranscriptionsummary_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowpasscodemodification",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowpasscodemodification_true",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowpasswordautofill",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowpasswordautofill_true",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowpasswordproximityrequests",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowpasswordproximityrequests_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowpasswordsharing",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowpasswordsharing_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowprintersharingmodification",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowprintersharingmodification_true",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowrapidsecurityresponseinstallation",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowrapidsecurityresponseinstallation_true",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowrapidsecurityresponseremoval",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowrapidsecurityresponseremoval_true",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowremoteappleeventsmodification",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowremoteappleeventsmodification_true",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowremotescreenobservation",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowremotescreenobservation_true",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowsafarihistoryclearing",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowsafarihistoryclearing_true",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowsafariprivatebrowsing",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowsafariprivatebrowsing_true",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowsafarisummary",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowsafarisummary_true",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowscreenshot",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowscreenshot_true",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowspotlightinternetresults",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowspotlightinternetresults_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowstartupdiskmodification",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowstartupdiskmodification_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowtimemachinebackup",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowtimemachinebackup_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowuiconfigurationprofileinstallation",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowuiconfigurationprofileinstallation_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowuniversalcontrol",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowuniversalcontrol_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowusbrestrictedmode",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowusbrestrictedmode_true",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowwallpapermodification",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowwallpapermodification_true",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowwritingtools",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowwritingtools_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_forcebypassscreencapturealert",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_forcebypassscreencapturealert_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_forceondeviceonlydictation",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_forceondeviceonlydictation_true",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_safariallowautofill",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_safariallowautofill_true",
                                    "children": []
                                }
                            }
                        ]
                    }
                ]
            }
        }
    ]
}